Ran Plan for dir: `staging` workspace: `staging`

<details><summary>Show Output</summary>

```diff
aws_instance.staging_example: Refreshing state... [id=i-06660102d5ef1de40]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_instance.staging_example will be destroyed
  # (because aws_instance.staging_example is not in configuration)
- resource "aws_instance" "staging_example" {
      - ami                                  = "ami-0862be96e41dcbf74" -> null
      - arn                                  = "arn:aws:ec2:us-east-2:825765385063:instance/i-06660102d5ef1de40" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-2b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-06660102d5ef1de40" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-02a846a9e3b91fe3a" -> null
      - private_dns                          = "ip-172-31-27-28.us-east-2.compute.internal" -> null
      - private_ip                           = "172.31.27.28" -> null
      - public_dns                           = "ec2-18-119-100-12.us-east-2.compute.amazonaws.com" -> null
      - public_ip                            = "18.119.100.12" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "default",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-071ad25e8a0341fc6" -> null
      - tags                                 = {
          - "Name" = "staging-example"
        } -> null
      - tags_all                             = {
          - "Name" = "staging-example"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0bc6baa6732ef2429",
        ] -> null
        # (8 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-085288f9fe1b36654" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_security_group.sg_allow_http will be created
+ resource "aws_security_group" "sg_allow_http" {
      + arn                    = (known after apply)
      + description            = "Allow wide open http inbound traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "allow-wide-open-http-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d staging -w staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://fd74-2600-6c40-59f0-b8b0-4474-a87c-c911-5975.ngrok-free.app/lock?id=achang209%252Fterraform-atlantis%252Fstaging%252Fstaging)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d staging -w staging
  ```
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```